<a href="https://colab.research.google.com/github/theysee/sberbank_reboot/blob/master/%D0%9F%D0%BE%D1%82%D0%BE%D0%BA_3_%D0%9F%D1%80%D0%B0%D0%BA%D1%82%D0%B8%D0%BA%D0%B0_%D0%BA_%D0%B7%D0%B0%D0%BD%D1%8F%D1%82%D0%B8%D1%8E_5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Практика



*   [Презентация](https://docs.google.com/presentation/d/1dLjCBWeGlhzU3A_JNg09ty-WPiAe4XObZBENp4tgC2Y/edit?usp=sharing)
*   [master](https://colab.research.google.com/drive/1TVa3TRpGfhQa3f6eKxAxmBEHsPHUVzxt)
*   [Дамп базы](https://drive.google.com/open?id=1RJx-1kh8az1OSQqnsDjCTWdzJBlDkjcB)

![схема базы](http://bdis.umeta.ru/db/db_course/labs/SQLpHTM/king.gif)

In [162]:
!pip install PyMySQL

Requirement already satisfied: PyMySQL in /usr/local/lib/python3.6/dist-packages (0.9.3)

In [163]:
!pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.6/dist-packages (0.25.3)
Requirement already satisfied: numpy>=1.13.3 in /usr/local/lib/python3.6/dist-packages (from pandas) (1.17.4)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas) (2018.9)
Requirement already satisfied: python-dateutil>=2.6.1 in /usr/local/lib/python3.6/dist-packages (from pandas) (2.6.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.6.1->pandas) (1.12.0)

In [0]:
import pymysql
import pandas as pd
# доступны student-ы от 0 до 49

DB_HOST = '89.223.95.235'
DB_USER = 'student_12'
DB_USER_PASSWORD = 'student_12'
DB_NAME = 'sample_db'

In [165]:
conn = pymysql.connect(DB_HOST, DB_USER, DB_USER_PASSWORD, DB_NAME)
pd.read_sql_query("select * from item", conn).head(10)

   order_id  item_id  product_id  actual_price  quantity   total
0       501        1      103130          3.60        60   216.0
1       502        1      104352         50.00        10   500.0
2       503        1      104350         38.00        30  1140.0
3       503        2      104351         23.60        10   236.0
4       503        3      104352         50.00        10   500.0
5       504        1      104350         40.00        10   400.0
6       504        2      104351         22.42        35   784.7
7       504        3      104352         50.00         5   250.0
8       505        1      103130          3.50       100   350.0
9       505        2      103140         20.00        15   300.0

### Задание 1
Выбрать всю информацию о каждом отделе и месте его расположения.

In [166]:
pd.read_sql_query("""
  SELECT
      department_id,
      name,
      regional_group,
      location.location_id
  FROM
      department
      INNER JOIN
      location
      ON department.location_id = location.location_id
""", conn)

    department_id        name regional_group  location_id
0              10  accounting       new york          122
1              12    research       new york          122
2              13       sales       new york          122
3              14  operations       new york          122
4              20    research         dallas          124
5              23       sales         dallas          124
6              24  operations         dallas          124
7              30       sales        chicago          123
8              34  operations        chicago          123
9              40  operations         boston          167
10             43       sales         boston          167

### Задание 2
Выбрать список фамилий сотрудников по городам, где они работают, с указанием для каждого его должности.

In [167]:
pd.read_sql_query("""
  SELECT
    employee_id,
    function 'должность',
    name as 'Имя отдела',
    regional_group 'город'
  FROM
    employee
  INNER JOIN
    job
  INNER JOIN
    department
  INNER JOIN
    location
  ON employee.job_id = job.job_id AND employee.department_id = department.department_id AND department.location_id = location.location_id
  ORDER BY
    'Имя отдела'
""", conn)

    employee_id    должность  Имя отдела     город
0          7782      manager  accounting  new york
1          7839    president  accounting  new york
2          7934        clerk  accounting  new york
3          7569      manager    research  new york
4          7799      analyst    research  new york
5          7916      analyst    research  new york
6          7919        clerk    research  new york
7          7505      manager       sales  new york
8          7555  salesperson       sales  new york
9          7557  salesperson       sales  new york
10         7600  salesperson       sales  new york
11         7950        clerk       sales  new york
12         7507      manager  operations  new york
13         7369        clerk    research    dallas
14         7566      manager    research    dallas
15         7788      analyst    research    dallas
16         7876        clerk    research    dallas
17         7902      analyst    research    dallas
18         7506      manager       sales    dallas
19         7560  salesperson       sales    dallas
20         7564  salesperson       sales    dallas
21         7789  salesperson       sales    dallas
22         7954        clerk       sales    dallas
23         7609        staff  operations    dallas
24         7499  salesperson       sales   chicago
25         7521  salesperson       sales   chicago
26         7654  salesperson       sales   chicago
27         7698      manager       sales   chicago
28         7844  salesperson       sales   chicago
29         7900        clerk       sales   chicago
30         7676        staff  operations   chicago
31         7820  salesperson       sales    boston

### Задание 3
 Выбрать всех покупателей, с которыми работает продавец TURNER.

In [168]:
pd.read_sql_query('''
  SELECT
    customer.name
  FROM
    employee
    INNER JOIN
    customer
    ON employee.employee_id = customer.salesperson_id AND employee.last_name = 'TURNER'
''', conn)

                                           name
0                                    jocksports
1                                  k + t sports
2  north woods health and fitness supply center

### Задание 4
Выбрать сотрудников, которые не закреплены за конкретным заказчиком.

In [169]:
pd.read_sql_query('''
  SELECT
    employee.first_name,
    employee.last_name,
    customer.name
  FROM
    employee
    LEFT OUTER JOIN
    customer
    ON employee.employee_id=customer.salesperson_id AND name IS NULL
''', conn)

   first_name last_name  name
0        john     smith  None
1       kevin     allen  None
2        jean     doyle  None
3        lynn    dennis  None
4      leslie     baker  None
5     cynthia      ward  None
6      daniel    peters  None
7       karen      shaw  None
8       sarah    duncan  None
9     gregory     lange  None
10      terry     jones  None
11      chris   alberts  None
12    raymond    porter  None
13    richard     lewis  None
14    kenneth    martin  None
15     denise   sommers  None
16     marion     blake  None
17      carol     clark  None
18     donald     scott  None
19      livia      west  None
20    matthew    fisher  None
21       paul      ross  None
22    francis      king  None
23       mary    turner  None
24      diane     adams  None
25       fred     james  None
26   jennifer      ford  None
27      grace   roberts  None
28    michael   douglas  None
29    barbara    miller  None
30      alice    jensen  None
31      james    murray  None

### Задание 5
Выбрать имена продавцов, которые работают более чем с одним покупателем и названия покупателей, которых они обслуживают.

In [170]:
pd.read_sql_query('''
  SELECT
    employee.first_name,
    employee.last_name,
    customer.name
  FROM
    employee
    JOIN
      customer
    ON employee.employee_id=customer.salesperson_id
  GROUP BY
    employee.first_name,
    employee.last_name,
    customer.name
  ORDER BY
    employee.last_name
''', conn)

   first_name last_name                                          name
0       kevin     allen                                every mountain
1       kevin     allen                                 womens sports
2       sarah    duncan                             the power forward
3       sarah    duncan                           al and bob's sports
4     gregory     lange                                 al's pro shop
5     gregory     lange                           hit, throw, and run
6     kenneth    martin                           bob's family sports
7     kenneth    martin                                     vollyrite
8      daniel    peters                                 fitness first
9      daniel    peters                                  century shop
10    raymond    porter                                     all sport
11    raymond    porter                                    good sport
12       paul      ross                                        at bat
13       paul      ross                                    fast break
14       paul      ross                                  the outfield
15       paul      ross                                   velo sports
16       paul      ross                                         hoops
17       paul      ross                              the all american
18       paul      ross                                      the tour
19      karen      shaw                                  the coliseum
20      karen      shaw                                stadium sports
21      karen      shaw                                   point guard
22      karen      shaw                                rebound sports
23       mary    turner                                    jocksports
24       mary    turner                                  k + t sports
25       mary    turner  north woods health and fitness supply center
26    cynthia      ward                                   just tennis
27    cynthia      ward                                      shape up
28    cynthia      ward                                tkb sport shop
29      livia      west                                    just bikes
30      livia      west                    bob's swim, cycle, and run
31      livia      west                              wheels and deals
32      livia      west                               joe's bike shop

### Задание 6
Выбрать сумму всех продаж, которые обеспечил продавец TURNER.

In [171]:
pd.read_sql_query('''
  SELECT
    employee.first_name,
    employee.last_name,
    SUM(sales_order.total)
  FROM
    sales_order
    JOIN
      customer
    ON sales_order.customer_id=customer.customer_id
    JOIN
      employee
    ON customer.salesperson_id=employee.employee_id
  WHERE
    last_name = 'turner'
  GROUP BY
    employee.first_name,
    employee.last_name
''', conn)

  first_name last_name  SUM(sales_order.total)
0       mary    turner                 58055.9

### Задание 7
Выбрать сумму всех продаж товаров, связанных с теннисом, за лето 1990г.

In [172]:
pd.read_sql_query('''
  SELECT
    SUM(sales_order.total)
  FROM
    sales_order
    JOIN
      item
    ON sales_order.order_id=item.order_id
    JOIN
      product
    ON product.product_id=item.product_id
  WHERE
    sales_order.order_date > '1990-06-01' 
    AND 
    sales_order.order_date < '1990-09-01'
    AND 
    product.description LIKE '%tennis%'
''', conn)

   SUM(sales_order.total)
0                 44462.9

### Задание 8
Выбрать имена и зарплаты самого старого и самого молодого сотрудника фирмы. ("Возраст" сотрудника определять по дате его поступления на работу в фирму).

In [173]:
pd.read_sql_query('''
  SELECT
    first_name,
    last_name,
    salary,
    hire_date
  FROM
    employee
  WHERE
    hire_date IN (SELECT MIN(hire_date) FROM employee)
    OR
    hire_date IN (SELECT MAX(hire_date) FROM employee)
''', conn)

  first_name last_name  salary  hire_date
0       john     smith   800.0 1984-12-17
1      james    murray   750.0 1987-01-16

### Задание 9
Для каждого продавца вывести разность между его зарплатой и средней зарплатой продавцов в фирме. Решение

In [174]:
pd.read_sql_query('''
  SELECT
    first_name,
    last_name,
    salary,
    salary - (SELECT AVG(salary) FROM employee) AS Calculate
  FROM
    employee
''', conn)

   first_name last_name  salary  Calculate
0        john     smith   800.0  -1096.875
1       kevin     allen  1600.0   -296.875
2        jean     doyle  2850.0    953.125
3        lynn    dennis  2750.0    853.125
4      leslie     baker  2200.0    303.125
5     cynthia      ward  1250.0   -646.875
6      daniel    peters  1250.0   -646.875
7       karen      shaw  1250.0   -646.875
8       sarah    duncan  1250.0   -646.875
9     gregory     lange  1250.0   -646.875
10      terry     jones  2975.0   1078.125
11      chris   alberts  3000.0   1103.125
12    raymond    porter  1250.0   -646.875
13    richard     lewis  1800.0    -96.875
14    kenneth    martin  1250.0   -646.875
15     denise   sommers  1850.0    -46.875
16     marion     blake  2850.0    953.125
17      carol     clark  2450.0    553.125
18     donald     scott  3000.0   1103.125
19      livia      west  1500.0   -396.875
20    matthew    fisher  3000.0   1103.125
21       paul      ross  1300.0   -596.875
22    francis      king  5000.0   3103.125
23       mary    turner  1500.0   -396.875
24      diane     adams  1100.0   -796.875
25       fred     james   950.0   -946.875
26   jennifer      ford  3000.0   1103.125
27      grace   roberts  2875.0    978.125
28    michael   douglas   800.0  -1096.875
29    barbara    miller  1300.0   -596.875
30      alice    jensen   750.0  -1146.875
31      james    murray   750.0  -1146.875

### Задание 10
Вывести имена, средние инициалы и фамилии всех однофамильцев.

In [175]:
pd.read_sql_query('''
  SELECT
    employee.first_name,
    employee.last_name,
    department.name
  FROM
    department
  INNER JOIN
    employee
  ON department.department_id = employee.department_id
  ORDER BY
    department.name
''', conn)
#Однофамильцев нет.

   first_name last_name        name
0       carol     clark  accounting
1     francis      king  accounting
2     barbara    miller  accounting
3      leslie     baker  operations
4     richard     lewis  operations
5      denise   sommers  operations
6       chris   alberts    research
7     matthew    fisher    research
8       grace   roberts    research
9     michael   douglas    research
10       john     smith    research
11      terry     jones    research
12     donald     scott    research
13      diane     adams    research
14   jennifer      ford    research
15       jean     doyle       sales
16     daniel    peters       sales
17      karen      shaw       sales
18    raymond    porter       sales
19      alice    jensen       sales
20       lynn    dennis       sales
21      sarah    duncan       sales
22    gregory     lange       sales
23      livia      west       sales
24      james    murray       sales
25      kevin     allen       sales
26    cynthia      ward       sales
27    kenneth    martin       sales
28     marion     blake       sales
29       mary    turner       sales
30       fred     james       sales
31       paul      ross       sales

### Задание 11
Для каждого отдела выбрать процент, который составляют сотрудники отдела от общего числа сотрудников фирмы, и процент, который составляет зарплата отдела от общей зарплаты фирмы.

In [176]:
pd.read_sql_query('''
  SELECT
    (COUNT(employee.employee_id)/(SELECT COUNT(employee_id) AS 'Count' FROM employee GROUP BY 'Count'))*100 AS 'Percent_Count',
    (SUM(employee.salary)/(SELECT SUM(salary) AS 'Sum' FROM employee GROUP BY 'Sum'))*100 AS 'Percent_Sum',
    department.name
  FROM
    department
  INNER JOIN
    employee
  ON department.department_id = employee.department_id
  GROUP BY
    department.name
  ORDER BY
    department.name
''', conn)

   Percent_Count  Percent_Sum        name
0          9.375    14.415157  accounting
1          9.375     9.637562  operations
2         28.125    33.855025    research
3         53.125    42.092257       sales

### Задание 12
Выбрать фамилии начальников тех отделов, которые имеют разветвленную структуру (т.е. тех начальников, у прямых подчиненных которых есть свои подчиненные).

In [177]:
pd.read_sql_query('''
  SELECT
    first_name,
    last_name,
    employee_id,
    manager_id
  FROM
    employee
  WHERE
    employee_id IN (SELECT manager_id FROM employee WHERE employee_id IN (SELECT manager_id FROM employee GROUP BY manager_id) GROUP BY manager_id)
''', conn)

  first_name last_name  employee_id  manager_id
0      terry     jones         7566      7839.0
1      chris   alberts         7569      7839.0
2    francis      king         7839         NaN

### Задание 13
Выбрать название отдела, заключившего сделку на самую большую сумму, и город, в котором он находится.

In [178]:
pd.read_sql_query('''
  SELECT
    sales_order.total,
    department.name,
    location.regional_group
  FROM
    sales_order
    JOIN
      customer
    ON customer.customer_id=sales_order.customer_id
    JOIN
      employee
    ON customer.salesperson_id=employee.employee_id
    JOIN
      department
    ON employee.department_id=department.department_id
    JOIN
      location
    ON department.location_id=location.location_id
  WHERE
    sales_order.total IN (SELECT MAX(total) FROM sales_order)
''', conn)

     total   name regional_group
0  46370.0  sales        chicago

### Задание 14
Выбрать название товара, дату продажи, цену продажи для всех случаев, когда товары продавались ниже, чем за 75% их объявленной цены.

In [179]:
pd.read_sql_query('''
  SELECT
    product.description,
    order_date,
    price.list_price AS announced,
    price.list_price*0.75 AS announced_with,
    item.actual_price AS sell_price
  FROM
    item
    JOIN
      sales_order
    ON item.order_id=sales_order.order_id
    JOIN
      product
    ON item.product_id=product.product_id
    JOIN
      price
    ON product.product_id=price.product_id
  WHERE
    item.actual_price<price.list_price*0.75
''', conn)

                    description order_date  ...  announced_with  sell_price
0  yellow jersey bicycle gloves 1989-05-26  ...           11.25        9.00
1  yellow jersey bicycle gloves 1989-06-04  ...           11.25        9.00
2  yellow jersey bicycle gloves 1989-09-30  ...           11.25        9.00
3  yellow jersey bicycle gloves 1990-03-04  ...           11.25        9.00
4  yellow jersey bicycle gloves 1990-03-31  ...           11.25       11.00
5  yellow jersey bicycle gloves 1990-09-04  ...           11.25       10.00
6  yellow jersey bicycle gloves 1991-03-04  ...           11.25       10.00
7    yellow jersey water bottle 1989-09-30  ...            2.25        1.90
8          sb energy bar-6 pack 1991-02-02  ...            1.80        1.75

[9 rows x 5 columns]

### Задание 15
Выбрать общую сумму скидок, предоставленных покупателю STADIUM SPORTS в 1989г.

In [180]:
pd.read_sql_query('''
  SELECT
    customer.name,
    YEAR(order_date) AS 'Year',
    SUM(price.list_price-item.actual_price) AS 'Discount'
  FROM
    item
    JOIN
      sales_order
    ON item.order_id=sales_order.order_id
    JOIN
      product
    ON item.product_id=product.product_id
    JOIN
      price
    ON product.product_id=price.product_id
    JOIN
      customer
    ON sales_order.customer_id=customer.customer_id
  WHERE
    customer.name='STADIUM SPORTS' AND YEAR(order_date)=1989
  GROUP BY
    Year
''', conn)

             name  Year  Discount
0  stadium sports  1989     63.11

### Задание 16
Выбрать список сотрудников фирмы с указанием фамилии непосредственного начальника каждого.

In [181]:
pd.read_sql_query('''
  SELECT 
    employee.employee_id AS 'worker_id',
    employee.first_name AS 'worker_fname',
    employee.last_name AS 'worker_lname',
    employee.manager_id AS 'manager_id',
    result.first_name AS 'boss_fname',
    result.last_name AS 'boss_lname',
    result.employee_id AS 'boss_id'
  FROM
    employee
    JOIN
      (SELECT first_name, last_name, employee_id FROM employee GROUP BY first_name, last_name, employee_id) AS result
    ON employee.manager_id=result.employee_id
''', conn)

    worker_id worker_fname worker_lname  ...  boss_fname boss_lname boss_id
0        7934      barbara       miller  ...       carol      clark    7782
1        7799      matthew       fisher  ...       chris    alberts    7569
2        7916        grace      roberts  ...       chris    alberts    7569
3        7876        diane        adams  ...      donald      scott    7788
4        7505         jean        doyle  ...     francis       king    7839
5        7506         lynn       dennis  ...     francis       king    7839
6        7507       leslie        baker  ...     francis       king    7839
7        7566        terry        jones  ...     francis       king    7839
8        7569        chris      alberts  ...     francis       king    7839
9        7698       marion        blake  ...     francis       king    7839
10       7782        carol        clark  ...     francis       king    7839
11       7555       daniel       peters  ...        jean      doyle    7505
12       7557        karen         shaw  ...        jean      doyle    7505
13       7600      raymond       porter  ...        jean      doyle    7505
14       7820         paul         ross  ...        jean      doyle    7505
15       7950        alice       jensen  ...        jean      doyle    7505
16       7369         john        smith  ...    jennifer       ford    7902
17       7609      richard        lewis  ...      leslie      baker    7507
18       7676       denise      sommers  ...      leslie      baker    7507
19       7560        sarah       duncan  ...        lynn     dennis    7506
20       7564      gregory        lange  ...        lynn     dennis    7506
21       7789        livia         west  ...        lynn     dennis    7506
22       7954        james       murray  ...        lynn     dennis    7506
23       7499        kevin        allen  ...      marion      blake    7698
24       7521      cynthia         ward  ...      marion      blake    7698
25       7654      kenneth       martin  ...      marion      blake    7698
26       7844         mary       turner  ...      marion      blake    7698
27       7900         fred        james  ...      marion      blake    7698
28       7919      michael      douglas  ...     matthew     fisher    7799
29       7788       donald        scott  ...       terry      jones    7566
30       7902     jennifer         ford  ...       terry      jones    7566

[31 rows x 7 columns]

### Задание 17
 Для каждого сотрудника вывести разность между его зарплатой и средней зарплатой сотрудников, выполняющих те же функции.

In [182]:
pd.read_sql_query('''
  SELECT 
    employee.first_name,
    employee.last_name,
    job.function,
    employee.salary,
    result.avg,
    employee.salary-result.avg AS difference
  FROM
    employee
    JOIN
      job
    ON employee.job_id=job.job_id
    JOIN
      (SELECT AVG(salary) AS avg, job.job_id FROM employee JOIN job ON employee.job_id=job.job_id GROUP BY job.job_id) AS result
    ON employee.job_id=result.job_id
''', conn)

   first_name last_name     function  salary          avg  difference
0        john     smith        clerk   800.0   921.428571 -121.428571
1       diane     adams        clerk  1100.0   921.428571  178.571429
2        fred     james        clerk   950.0   921.428571   28.571429
3     michael   douglas        clerk   800.0   921.428571 -121.428571
4     barbara    miller        clerk  1300.0   921.428571  378.571429
5       alice    jensen        clerk   750.0   921.428571 -171.428571
6       james    murray        clerk   750.0   921.428571 -171.428571
7     richard     lewis        staff  1800.0  1825.000000  -25.000000
8      denise   sommers        staff  1850.0  1825.000000   25.000000
9      donald     scott      analyst  3000.0  2968.750000   31.250000
10    matthew    fisher      analyst  3000.0  2968.750000   31.250000
11   jennifer      ford      analyst  3000.0  2968.750000   31.250000
12      grace   roberts      analyst  2875.0  2968.750000  -93.750000
13      kevin     allen  salesperson  1600.0  1331.818182  268.181818
14    cynthia      ward  salesperson  1250.0  1331.818182  -81.818182
15     daniel    peters  salesperson  1250.0  1331.818182  -81.818182
16      karen      shaw  salesperson  1250.0  1331.818182  -81.818182
17      sarah    duncan  salesperson  1250.0  1331.818182  -81.818182
18    gregory     lange  salesperson  1250.0  1331.818182  -81.818182
19    raymond    porter  salesperson  1250.0  1331.818182  -81.818182
20    kenneth    martin  salesperson  1250.0  1331.818182  -81.818182
21      livia      west  salesperson  1500.0  1331.818182  168.181818
22       paul      ross  salesperson  1300.0  1331.818182  -31.818182
23       mary    turner  salesperson  1500.0  1331.818182  168.181818
24       jean     doyle      manager  2850.0  2725.000000  125.000000
25       lynn    dennis      manager  2750.0  2725.000000   25.000000
26     leslie     baker      manager  2200.0  2725.000000 -525.000000
27      terry     jones      manager  2975.0  2725.000000  250.000000
28      chris   alberts      manager  3000.0  2725.000000  275.000000
29     marion     blake      manager  2850.0  2725.000000  125.000000
30      carol     clark      manager  2450.0  2725.000000 -275.000000
31    francis      king    president  5000.0  5000.000000    0.000000

### Задание 18
Вывести таблицу распределения объема продаж товара DUNK BASKETBALL INDOOR по годам.

In [183]:
pd.read_sql_query('''
  SELECT 
    product.description,
    SUM(item.quantity) AS 'sum',
    result.year
  FROM
    product
    JOIN
      item
    ON product.product_id=item.product_id
    JOIN
      sales_order
    ON item.order_id=sales_order.order_id
    JOIN
      (SELECT order_id, YEAR(order_date) AS year FROM sales_order) AS result
    ON sales_order.order_id=result.order_id
  WHERE
    description='DUNK BASKETBALL INDOOR'
  GROUP BY
    result.year
''', conn)

              description    sum  year
0  dunk basketball indoor  150.0  1989
1  dunk basketball indoor  130.0  1990
2  dunk basketball indoor   85.0  1991

### Задание 19
Выбрать фамилии тех сотрудников, у которых суммарный доход (зарплата + комиссионные) больше 2000.

In [229]:
pd.read_sql_query('''
  SELECT
    *
  FROM
    ( SELECT 
        employee.employee_id,
        employee.first_name,
        employee.last_name,
        employee.salary+employee.commission AS 'income'
      FROM
        employee
      WHERE
        employee.commission IS NOT NULL
      UNION ALL
      SELECT 
        employee.employee_id,
        employee.first_name,
        employee.last_name,
        employee.salary
      FROM
        employee
      WHERE
        employee.commission IS NULL
      GROUP BY
        employee.employee_id) AS result
  WHERE
    income>2000
''', conn)

    employee_id first_name last_name  income
0          7557      karen      shaw  2450.0
1          7600    raymond    porter  2150.0
2          7654    kenneth    martin  2650.0
3          7789      livia      west  2500.0
4          7820       paul      ross  2100.0
5          7505       jean     doyle  2850.0
6          7506       lynn    dennis  2750.0
7          7507     leslie     baker  2200.0
8          7566      terry     jones  2975.0
9          7569      chris   alberts  3000.0
10         7698     marion     blake  2850.0
11         7782      carol     clark  2450.0
12         7788     donald     scott  3000.0
13         7799    matthew    fisher  3000.0
14         7839    francis      king  5000.0
15         7902   jennifer      ford  3000.0
16         7916      grace   roberts  2875.0

### Задание 20
Выбрать названия товаров, для которых нынешняя цена увеличилась по сравнению с ценой на 15 декабря 1989г. более, чем на 15%.

![схема базы](http://bdis.umeta.ru/db/db_course/labs/SQLpHTM/king.gif)